modules/multiDimAMR/test/test-2DHex/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    //fvMeshDistribute 3;
    //fvMesh 3;
    //polyMesh 3;
    //topoChangerLoadBalanceFvMesh 3;
    //domainDecomposition 3;
}

application     testUpdate; // meshUpdater

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           10;
maxAlphaCo      0.5;

maxDeltaT       1;

libs
(
    "libpolyRef.so"
);


// ************************************************************************* //
