modules/multiDimAMR/test/test-2DHex/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue alpha.water 0.0
    volScalarFieldValue alpha 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.501 0.501 1);
        fieldValues
        (
            //volScalarFieldValue alpha.water 1
	        volScalarFieldValue alpha 0.5
        );
    }
);


// ************************************************************************* //
